## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # digitalocean_loadbalancer.ingress_load_balancer will be created
+   resource "digitalocean_loadbalancer" "ingress_load_balancer" {
+       algorithm                        = "round_robin"
+       disable_lets_encrypt_dns_records = false
+       droplet_ids                      = (known after apply)
+       enable_backend_keepalive         = false
+       enable_proxy_protocol            = false
+       id                               = (known after apply)
+       ip                               = (known after apply)
+       name                             = "wayofthesys.org-lb"
+       redirect_http_to_https           = false
+       region                           = "nyc3"
+       size                             = "lb-medium"
+       size_unit                        = (known after apply)
+       status                           = (known after apply)
+       urn                              = (known after apply)
+       vpc_uuid                         = "b2f81487-3dc2-4da6-8a59-7850d675ca89"

+       forwarding_rule {
+           certificate_id   = (known after apply)
+           certificate_name = (known after apply)
+           entry_port       = 80
+           entry_protocol   = "http"
+           target_port      = 80
+           target_protocol  = "http"
+           tls_passthrough  = false
        }

+       healthcheck {
+           check_interval_seconds   = (known after apply)
+           healthy_threshold        = (known after apply)
+           path                     = (known after apply)
+           port                     = (known after apply)
+           protocol                 = (known after apply)
+           response_timeout_seconds = (known after apply)
+           unhealthy_threshold      = (known after apply)
        }

+       sticky_sessions {
+           cookie_name        = (known after apply)
+           cookie_ttl_seconds = (known after apply)
+           type               = (known after apply)
        }
    }

  # kubernetes_ingress_v1.argocd_ingress will be updated in-place
!   resource "kubernetes_ingress_v1" "argocd_ingress" {
        id     = "argocd/argocd-ingress"
        # (1 unchanged attribute hidden)

!       spec {
            # (1 unchanged attribute hidden)

+           default_backend {

+               service {
+                   name = "argocd-argo-cd-server"

+                   port {
+                       number = 80
                    }
                }
            }

!           rule {
                # (1 unchanged attribute hidden)

!               http {
!                   path {
                        # (2 unchanged attributes hidden)

!                       backend {

!                           service {
!                               name = "argocd-server" -> "argocd-argo-cd-server"

                                # (1 unchanged block hidden)
                            }
                        }
                    }
                }
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
